package com.f2z.gach.Entity.EnumType;

public enum Departments {
    //가천리버럴아츠칼리지
    자유전공, 한국학전공,
    //경영대학
    경영학부, 금융수학과,
    //사회과학대학
    미디어커뮤니케이션학과, 관광경경학과, 경제학과, 의료산업경영학과, 응용통계학과, 사회복지학과, 유아교육학과, 심리학과,
    //인문대학
    한국어문학과, 영미어문학과, 동양어문학과, 유럽어문학과,
    //법과대학
    법학과, 경찰행정학과, 행정학과, 경찰학연계전공,
    //공과대학
    도시계획학전공, 조경학전공, 실내건축학전공, 건축학전공, 건축공학전공, 설비소방공학과, 화공생명공학과, 기계공학과, 토목환경공학과, 산업경영공학과,
    신소재공학과, 스마트팩토리전공, 미래자동차학과,
    //바이오나노대학
    바이오나노학과, 화학과, 물리학과, 생명과학과, 식품생물공학과, 식품영양학과,
    //IT융합대학
    AI소프트웨어학부, 컴퓨터공학과, 전기공학과, 에너지IT학과, 의공학과, 스마트시티학과, 스마트보안전공, 클라우드공학과, 게임영상학과, 바이오의료기기학과,
    //한의과대학
    한의예과, 한의학과,
    //예술체육대학
    회화조소전공, 시각디자인전공, 산업디자인전공, 패션디자인전공, 기악전공, 성악전공, 작곡전공, 체육전공, 태권도전공, 연기예술학과,
    //반도체대학
    전자공학전공, 반도체공학전공, 차세대반도체설계전공, 반도체디스플레이학과, 반도체설계학과

}
